[
	{
		"title": "Media Tracker",
		"tags": ["personal"],
		"description": "A Letterboxd, Goodreads, Fable clone. Users keep track of the different forms of media they consumed ranging from Movies, TV shows, Video Games, Books and Board games. This app uses external APIs for users to save consumed media on. Users can also custom watchlists and rank their favorite forms of media. Work in progress.",
		"link": "https://github.com/matereyes00/api_app",
		"stack": [
			"HTML5",
			"CSS3",
			"Django",
			"Bootstrap",
			"Docker",
			"PostgreSQL",
			"Git",
			"Python"
		]
	},
	{
		"title": "To Do List",
		"tags": ["personal"],
		"description": "Simple to do list app that uses REST API to create, edit, and delete lists. Work in progress.",
		"link": "https://github.com/matereyes00/toDoList",
		"stack": ["NestJS", "Postman", "NodeJS", "Docker", "PostgreSQL", "Git"]
	},
	{
		"title": "I-HOPE",
		"tags": ["personal", "school_project"],
		"description": "UI for the flow of data in my study. Users can view the current location of all existing RHUs in the Philippines and work their way towards determining the number of RHUs needed per city in a region. The site only accommodates region 1 data. Work in progress.",
		"link": "https://github.com/matereyes00/iHOPE",
		"stack": ["Python", "Streamlit", "Jupyter", "Figma", "QGIS"],
		"deployedProject": ""
	},
	{
		"title": "Rock, Paper, Scissors",
		"tags": ["school_project", "personal"],
		"description": "A rock paper scissors game that uses sockets for users to play remotely.",
		"link": "https://github.com/matereyes00/CSCI70-group-files/tree/master/Group%20Game",
		"stack": ["Python", "Git"]
	},
	{
		"title": "Fake News Spread Simulation",
		"tags": ["school_project"],
		"description": "A requirement for CSCI 115: Simulation class to observe the impact of fake-bots on X spreading misinformation and fake news.",
		"link": "",
		"stack": ["Python", "Jupyter"],
		"deployedProject": "https://drive.google.com/file/d/1ZOfkFYkSptU2AHnAvQHsWKJDl_D75sAZ/view?usp=sharing"
	},
	{
		"title": "Plant Infinity",
		"tags": ["school_project"],
		"description": "The aim of this project is to demonstrate the behavior of an agent using Depth First Search and Breadth First Search. The agent's actions are to plant a seed, check the plant's status, water, and harvest the plant. It's a mini game to showcase the navigation of an agent in its environment.",
		"link": "#",
		"stack": ["Python", "Jupyter"],
		"deployedProject": "https://colab.research.google.com/drive/1QwDtTOLzgW08U26NKhIUt3NW_Bu8qyfR?usp=sharing"
	},
	{
		"title": "LostNFound",
		"tags": ["school_project"],
		"description": "Final requirement project for CSCI 281: Android Development. The task was to create a basic application that integrates all the concepts and modules delivered in the class. The aim of LostNFound is an improved version of an Ateneo facebook group. Members of the school can post pictures and claim items.",
		"link": "https://github.com/matereyes00/LostNFound",
		"stack": ["Android", "Java", "Git"],
		"deployedProject": "#"
	},
	{
		"title": "Boodle",
		"tags": ["school_project"],
		"description": "This is an iterative project for our introduction to software engineering class. We decided to model an ecommerce website where users can buy and sell items. As buyers, users can bid on items they want for themselves. They can set the price and other users can see the highest bid priced for a specific item. As sellers, users can create their own shop where they can list items for bidding.",
		"link": "#",
		"stack": ["Python", "Django", "SQL", "PostgreSQL", "Git", "GitLab"],
		"deployedProject": "#"
	},
	{
		"title": "Blizard Blast",
		"tags": ["school_project"],
		"description": "This is a final project for our introduction to databases class. The task was to create a database for a real-world application. My group was assigned to a milkshare company. Our database is a static website designed for admin use. The user can view the store's inventory and keep track of different customer's orders. The idea was to demonstrate SQL querying in the context of a business setting.",
		"link": "https://github.com/matereyes00/Blizzard-Blast",
		"stack": ["Python", "Django", "SQL", "PostgreSQL", "Git", "GitLab"],
		"deployedProject": "#"
	},
	{
		"title": "Byte: Startup Summit 2022",
		"tags": ["organization"],
		"description": "This is a website for one of Byte's, an Ateneo organization, flagship projects: Startup Summit (SuS) for 2022. The task was to build a static website where users and participants could view information on the event.",
		"link": "https://github.com/BYTE-ADMU/startup-summit-2022",
		"stack": ["JavaScript", "HTML5", "CSS3", "Git", "Figma", "React"]
	},
	{
		"title": "Edsa Interactive",
		"tags": ["organization"],
		"description": "This is a website for The Guidon's EDSA interactive for the EDSA Revolution's 37th anniversary. The website features different articles highlighting Ateneo's involvement and activism against the Marcoses.",
		"link": "https://github.com/theguidon/edsa-interactive-2223",
		"stack": ["HTML5", "CSS3", "JavaScript", "Git", "Figma", "WordPress"],
		"deployedProject": "https://interactive.theguidon.com/2023/02/from-the-hill-to-edsa/#battle-in-the-broadsheets"
	}
]
